pgodwin/LC-SCSI/src/LCSCSI-STM32/filesystem.c


#include <stdbool.h>
#include <stdio.h>
#include <string.h>
//#include <ff.h>

#include "stm32f4xx.h"
#include "tm_stm32_fatfs.h"


#include "filesystem.h"
#include "debug.h"

// File system state structure
struct filesystemStateStruct
{
	FATFS fsObject; 			// FAT FS file system object
	DIR dirObject; 			// FAT FS directory object
	FIL fileObject; 			// FAT FS file objects

	FRESULT fsResult; 		// FAT FS common result code
	UINT fsCounter; 			// FAT FS byte counter
	FILINFO fsInfo; 			// FAT FS file info object
	
	bool fsMountState; 		// File system mount state (true = mounted, false = dismounted)
	
	uint8_t lunDirectory; 	// Current LUN directory ID
	bool fsLunStatus[8]; 	// LUN image availability flags for the currently selected LUN directory (true = started, false = stopped)
	uint8_t fsLunUserCode[8][5]; 	// LUN 5-byte User code (used for F-Code interactions - only present for laser disc images)
	
} filesystemState;

char fileName[255]; 			// String for storing LFN filename
char fatDirectory[255]; 		// String for storing FAT directory (for FAT transfer operations)

uint8_t sectorBuffer[SECTOR_BUFFER_SIZE]; 	// Buffer for reading sectors
bool lunOpenFlag = false;  // Flag to track when a LUN is open for read/write (to prevent multiple file opens)

// Globals for multi-sector reading
uint32_t sectorsInBuffer = 0;
uint32_t currentBufferSector = 0;
uint32_t sectorsRemaining = 0;


// External prototypes
void filesystemInitialise(void)
{
	if (debugFlag_filesystem) debugString_P(PSTR("File system: filesystemInitialise(): Initialising file system\r\n"));
	filesystemState.lunDirectory = 0; 		// Default to LUN directory 0
	filesystemState.fsMountState = false; 	// FS default state is unmounted
	
	
	
	// Mount the file system
	filesystemMount();
	
	// Set the default FAT transfer directory
	sprintf(fatDirectory, "/Transfer");
}


void filesystemReset(void)
{
	uint8_t lunNumber;
	bool errorFlag = false;
	
	if (debugFlag_filesystem) debugString_P(PSTR("File system: filesystemReset(): Resetting file system\r\n"));
	
	// Reset the default FAT transfer directory
	sprintf(fatDirectory, "/Transfer");
	
	// Is the SD card/FAT file system  mounted?
	if(filesystemState.fsMountState == true)
	{
		if (debugFlag_filesystem) debugString_P(PSTR("File system: filesystemReset(): File system is flagged as mounted\r\n"));
		
		// Test mounted LUNs to make sure they are still available
		// Note: This is in case the SD card has been removed or changed since the last reset.
		for(lunNumber = 0 ; lunNumber < 8 ; lunNumber++)
		{
			// If the LUN status is available, test it to make sure
			if(filesystemReadLunStatus(lunNumber))
			{
				if (!filesystemTestLunStatus(lunNumber)) errorFlag = true;
			}
		}
		
		// If any of the LUN's had an invalid status we should remount to ensure everything is ok.
		if(errorFlag)
		{
			debugString_P(PSTR("File system: filesystemReset(): LUN status flags are incorrect!\r\n"));
			
			// Dismount and then mount file system to ensure it is correct
			filesystemDismount();
			filesystemMount();
		}
	}
	else
	{
		// If the file system is not currently mounted, attempt to mount it
		if(debugFlag_filesystem) debugString_P(PSTR("File system: filesystemReset(): File system is not mounted - attempting to mount\r\n"));
		filesystemMount();
	}
}

bool filesystemMount(void)
{
	if(debugFlag_filesystem) debugString_P(PSTR("File system: filesystemMount(): Mounting file system\r\n"));
	
	// Is the file system already mounted?
	if(filesystemState.fsMountState == true)
	{
		if (debugFlag_filesystem) debugString_P(PSTR("File system: filesystemMount(): ERROR: File system is already mounted\r\n"));
		return false;
	}
	
	// Set all LUNs to stopped
	filesystemSetLunStatus(0, false);
	filesystemSetLunStatus(1, false);
	filesystemSetLunStatus(2, false);
	filesystemSetLunStatus(3, false);
	filesystemSetLunStatus(4, false);
	filesystemSetLunStatus(5, false);
	filesystemSetLunStatus(6, false);
	filesystemSetLunStatus(7, false);
	
	// Mount the SD card
	filesystemState.fsResult = f_mount(&filesystemState.fsObject, "SD:", 1);
	// Check the result
	if(filesystemState.fsResult != FR_OK)
	{
		if (debugFlag_filesystem)
		{
			switch (filesystemState.fsResult)
			{
			case FR_INVALID_DRIVE:
				debugString_P(PSTR("File system: filesystemMount(): ERROR: FR_INVALID_DRIVE\r\n"));
				break;
				
			case FR_DISK_ERR:
				debugString_P(PSTR("File system: filesystemMount(): ERROR: FR_DISK_ERR\r\n"));
				break;
				
			case FR_NOT_READY:
				debugString_P(PSTR("File system: filesystemMount(): ERROR: FR_NOT_READY - No SD Card reports not ready!\r\n"));
				break;
				
			case FR_NO_FILESYSTEM:
				debugString_P(PSTR("File system: filesystemMount(): ERROR: FR_NO_FILESYSTEM - SD Card not formatted?\r\n"));
				break;
				
			default:
				debugString_P(PSTR("File system: filesystemMount(): ERROR: Unknown error\r\n"));
			}	
		}
		
		// Exit with error status
		filesystemState.fsMountState = false;
		return false;
	}
	
	if (debugFlag_filesystem) debugString_P(PSTR("File system: filesystemMount(): Successful\r\n"));
	filesystemState.fsMountState = true;
	
	// Note: ADFS does not send a SCSI STARTSTOP command on reboot... it assumes that LUN 0 is already started.
	// This is theoretically incorrect... the host should not assume anything about the state of a SCSI LUN.
	// However, in order to support this buggy implementation we have to start LUN 0 here.
	filesystemSetLunStatus(0, true);
	
	return true;
}
bool filesystemDismount(void)
{
	if (debugFlag_filesystem) debugString_P(PSTR("File system: filesystemDismount(): Dismounting file system\r\n"));
	
	// Is the file system mounted?
	if(filesystemState.fsMountState == false)
	{
		// Nothing to do...
		debugString_P(PSTR("File system: filesystemDismount(): No file system to dismount\r\n"));
		return false;
	}
	
	// Set all LUNs to stopped
	filesystemSetLunStatus(0, false);
	filesystemSetLunStatus(1, false);
	filesystemSetLunStatus(2, false);
	filesystemSetLunStatus(3, false);
	filesystemSetLunStatus(4, false);
	filesystemSetLunStatus(5, false);
	filesystemSetLunStatus(6, false);
	filesystemSetLunStatus(7, false);
	
	// Dismount the SD card
	filesystemState.fsResult = f_mount(&filesystemState.fsObject, "", 0);
	
	// Check the result
	if(filesystemState.fsResult != FR_OK)
	{
		if (debugFlag_filesystem)
		{
			switch (filesystemState.fsResult)
			{
			case FR_INVALID_DRIVE:
				debugString_P(PSTR("File system: filesystemDismount(): ERROR: FR_INVALID_DRIVE\r\n"));
				break;
				
			case FR_DISK_ERR:
				debugString_P(PSTR("File system: filesystemDismount(): ERROR: FR_DISK_ERR\r\n"));
				break;
				
			case FR_NOT_READY:
				debugString_P(PSTR("File system: filesystemDismount(): ERROR: FR_NOT_READY\r\n"));
				break;
				
			case FR_NO_FILESYSTEM:
				debugString_P(PSTR("File system: filesystemDismount(): ERROR: FR_NO_FILESYSTEM\r\n"));
				break;
				
			default:
				debugString_P(PSTR("File system: filesystemDismount(): ERROR: Unknown error\r\n"));
			}
		}
		
		// Exit with error status
		filesystemState.fsMountState = false;
		return false;
	}
	
	if (debugFlag_filesystem) debugString_P(PSTR("File system: filesystemDismount(): Successful\r\n"));
	filesystemState.fsMountState = false;
	return true;
}

