pgodwin/LC-SCSI/src/LCSCSI-STM32/filesystem.c
// LUN status control functions -------------------------------------------------------------------------------------------------------------------------------

// Function to set the status of a LUN image
bool filesystemSetLunStatus(uint8_t lunNumber, bool lunStatus)
{
	// Is the requested status the same as the current status?
	if(filesystemState.fsLunStatus[lunNumber] == lunStatus)
	{
		if (debugFlag_filesystem)
		{
			debugStringInt16_P(PSTR("File system: filesystemSetLunStatus(): LUN number "), (uint16_t)lunNumber, false);
			if (filesystemState.fsLunStatus[lunNumber]) debugString_P(PSTR(" is started\r\n"));
			else debugString_P(PSTR(" is stopped\r\n"));
		}
		
		return true;
	}
	
	// Transitioning from stopped to started?
	if(filesystemState.fsLunStatus[lunNumber] == false && lunStatus == true)
	{
		// Is the file system mounted?
		if(filesystemState.fsMountState == false)
		{
			// Nothing to do...
			if(debugFlag_filesystem) debugString_P(PSTR("File system: filesystemSetLunStatus(): ERROR: No file system mounted - cannot set LUNs to started!\r\n"));
			return false;
		}
		
		// If the LUN image is starting the file system needs to recheck the LUN and LUN
		// descriptor to ensure everything is up to date
		
		// Check that the currently selected LUN directory exists (and, if not, create it)
		if(!filesystemCheckLunDirectory(filesystemState.lunDirectory))
		{
			// Failed!
			if(debugFlag_filesystem) debugString_P(PSTR("File system: filesystemSetLunStatus(): ERROR: Could not access LUN image directory!\r\n"));
			return false;
		}
		
		// Check that the LUN image exists
		if(!filesystemCheckLunImage(lunNumber))
		{
			// Failed!
			if(debugFlag_filesystem) debugString_P(PSTR("File system: filesystemSetLunStatus(): ERROR: Could not access LUN image file!\r\n"));
			return false;
		}
		
		// Exit with success
		filesystemState.fsLunStatus[lunNumber] = true;
		
		if (debugFlag_filesystem)
		{
			debugStringInt16_P(PSTR("File system: filesystemSetLunStatus(): LUN number "), (uint16_t)lunNumber, false);
			debugString_P(PSTR(" is started\r\n"));
		}
		
		return true;
	}
	
	// Transitioning from started to stopped?
	if(filesystemState.fsLunStatus[lunNumber] == true && lunStatus == false)
	{
		// If the LUN image is stopping the file system doesn't need to do anything other
		// than note the change of status
		filesystemState.fsLunStatus[lunNumber] = false;
		
		if (debugFlag_filesystem)
		{
			debugStringInt16_P(PSTR("File system: filesystemSetLunStatus(): LUN number "), (uint16_t)lunNumber, false);
			debugString_P(PSTR(" is stopped\r\n"));
		}
		
		// Exit with success
		return true;
	}
	
	return false;
}

// Function to read the status of a LUN image
bool filesystemReadLunStatus(uint8_t lunNumber)
{
	return filesystemState.fsLunStatus[lunNumber];
}

// Function to confirm that a LUN image is still available
bool filesystemTestLunStatus(uint8_t lunNumber)
{
	if (filesystemState.fsLunStatus[lunNumber] == true)
	{
		// Check that the LUN image exists
		if(!filesystemCheckLunImage(lunNumber))
		{
			// Failed!
			if(debugFlag_filesystem) debugString_P(PSTR("File system: filesystemTestLunStatus(): ERROR: Could not access LUN image file!\r\n"));
			return false;
		}
	}
	else
	{
		// LUN is not marked as available!
		if(debugFlag_filesystem) debugString_P(PSTR("File system: filesystemTestLunStatus(): LUN status is marked as stopped - cannot test\r\n"));
		return false;
	}
	
	// LUN tested OK
	return true;
}

// Function to read the user code for the specified LUN image
void filesystemReadLunUserCode(uint8_t lunNumber, uint8_t userCode[5])
{
	userCode[0] = filesystemState.fsLunUserCode[lunNumber][0];
	userCode[1] = filesystemState.fsLunUserCode[lunNumber][1];
	userCode[2] = filesystemState.fsLunUserCode[lunNumber][2];
	userCode[3] = filesystemState.fsLunUserCode[lunNumber][3];
	userCode[4] = filesystemState.fsLunUserCode[lunNumber][4];
}

// Check that the currently selected LUN directory exists (and, if not, create it)
bool filesystemCheckLunDirectory(uint8_t lunDirectory)
{
	// Is the file system mounted?
	if(filesystemState.fsMountState == false)
	{
		if (debugFlag_filesystem) debugString_P(PSTR("File system: filesystemCheckLunDirectory(): ERROR: No file system mounted\r\n"));
		return false;
	}
	
	// Does a directory exist for the currently selected LUN directory - if not, create it
	sprintf(fileName, "/BeebSCSI%d", lunDirectory);
	
	filesystemState.fsResult = f_opendir(&filesystemState.dirObject, fileName);
	
	// Check the result
	if(filesystemState.fsResult != FR_OK)
	{
		switch (filesystemState.fsResult)
		{
		case FR_NO_PATH:
			if (debugFlag_filesystem) debugString_P(PSTR("File system: filesystemCheckLunDirectory(): f_opendir returned FR_NO_PATH - Directory does not exist\r\n"));
			break;
			
		case FR_DISK_ERR:
			if (debugFlag_filesystem) debugString_P(PSTR("File system: filesystemCheckLunDirectory(): ERROR: f_opendir returned FR_DISK_ERR\r\n"));
			return false;
			break;
			
		case FR_INT_ERR:
			if (debugFlag_filesystem) debugString_P(PSTR("File system: filesystemCheckLunDirectory(): ERROR: f_opendir returned FR_INT_ERR\r\n"));
			return false;
			break;
			
		case FR_INVALID_NAME:
			if (debugFlag_filesystem) debugString_P(PSTR("File system: filesystemCheckLunDirectory(): ERROR: f_opendir returned FR_INVALID_NAME\r\n"));
			return false;
			break;
			
		case FR_INVALID_OBJECT:
			if (debugFlag_filesystem) debugString_P(PSTR("File system: filesystemCheckLunDirectory(): ERROR: f_opendir returned FR_INVALID_OBJECT\r\n"));
			return false;
			break;
			
		case FR_INVALID_DRIVE:
			if (debugFlag_filesystem) debugString_P(PSTR("File system: filesystemCheckLunDirectory(): ERROR: f_opendir returned FR_INVALID_DRIVE\r\n"));
			return false;
			break;
			
		case FR_NOT_ENABLED:
			if (debugFlag_filesystem) debugString_P(PSTR("File system: filesystemCheckLunDirectory(): ERROR: f_opendir returned FR_NOT_ENABLED\r\n"));
			return false;
			break;
			
		case FR_NO_FILESYSTEM:
			if (debugFlag_filesystem) debugString_P(PSTR("File system: filesystemCheckLunDirectory(): ERROR: f_opendir returned FR_NO_FILESYSTEM\r\n"));
			return false;
			break;
			
		case FR_TIMEOUT:
			if (debugFlag_filesystem) debugString_P(PSTR("File system: filesystemCheckLunDirectory(): ERROR: f_opendir returned FR_TIMEOUT\r\n"));
			return false;
			break;
			
		case FR_NOT_ENOUGH_CORE:
			if (debugFlag_filesystem) debugString_P(PSTR("File system: filesystemCheckLunDirectory(): ERROR: f_opendir returned FR_NOT_ENOUGH_CORE\r\n"));
			return false;
			break;
			
		case FR_TOO_MANY_OPEN_FILES:
			if (debugFlag_filesystem) debugString_P(PSTR("File system: filesystemCheckLunDirectory(): ERROR: f_opendir returned FR_TOO_MANY_OPEN_FILES\r\n"));
			return false;
			break;
			
		default:
			if (debugFlag_filesystem) debugString_P(PSTR("File system: filesystemCheckLunDirectory(): ERROR: f_opendir returned unknown error\r\n"));
			return false;
			break;
		}
	}
	
	// Did a directory exist?
	if(filesystemState.fsResult == FR_NO_PATH)
	{
		f_closedir(&filesystemState.dirObject);
		
