pgodwin/LC-SCSI/src/LCSCSI-STM32/filesystem.c
		// Create the LUN image directory - it's not present on the SD card
		filesystemState.fsResult = f_mkdir(fileName);
		
		// Now open the directory
		filesystemState.fsResult = f_opendir(&filesystemState.dirObject, fileName);
		
		// Check the result
		if(filesystemState.fsResult != FR_OK)
		{
			if (debugFlag_filesystem) debugString_P(PSTR("File system: filesystemCheckLunDirectory(): ERROR: Unable to create LUN directory\r\n"));
			f_closedir(&filesystemState.dirObject);
			return false;
		}
		
		if (debugFlag_filesystem) debugString_P(PSTR("File system: filesystemCheckLunDirectory(): Created LUN directory entry\r\n"));
		f_closedir(&filesystemState.dirObject);
	}
	else
	{
		if (debugFlag_filesystem) debugString_P(PSTR("File system: filesystemCheckLunDirectory(): LUN directory found\r\n"));
		f_closedir(&filesystemState.dirObject);
	}
	
	return true;
}

// Function to scan for SCSI LUN image file on the mounted file system
// and check the image is valid.
bool filesystemCheckLunImage(uint8_t lunNumber)
{
	uint32_t lunFileSize;
	uint32_t lunDscSize;

	// Attempt to open the LUN image
	sprintf(fileName, "/BeebSCSI%d/scsi%d.dat", filesystemState.lunDirectory, lunNumber);
	if (debugFlag_filesystem) debugStringInt16_P(PSTR("File system: filesystemCheckLunImage(): Checking for (.dat) LUN image "), (uint16_t)lunNumber, 1);
	filesystemState.fsResult = f_open(&filesystemState.fileObject, fileName, FA_READ);
		
	if (filesystemState.fsResult != FR_OK)
	{
		if (debugFlag_filesystem)
		{
			switch (filesystemState.fsResult)
			{
			case FR_DISK_ERR:
				debugString_P(PSTR("File system: filesystemCheckLunImage(): ERROR: f_open on LUN image returned FR_DISK_ERR\r\n"));
				break;
					
			case FR_INT_ERR:
				debugString_P(PSTR("File system: filesystemCheckLunImage(): ERROR: f_open on LUN image returned FR_INT_ERR\r\n"));
				break;
					
			case FR_NOT_READY:
				debugString_P(PSTR("File system: filesystemCheckLunImage(): ERROR: f_open on LUN image returned FR_NOT_READY\r\n"));
				break;

			case FR_NO_FILE:
				debugString_P(PSTR("File system: filesystemCheckLunImage(): LUN image not found\r\n"));
				break;
					
			case FR_NO_PATH:
				debugString_P(PSTR("File system: filesystemCheckLunImage(): ERROR: f_open on LUN image returned FR_NO_PATH\r\n"));
				break;

			case FR_INVALID_NAME:
				debugString_P(PSTR("File system: filesystemCheckLunImage(): ERROR: f_open on LUN image returned FR_INVALID_NAME\r\n"));
				break;

			case FR_DENIED:
				debugString_P(PSTR("File system: filesystemCheckLunImage(): ERROR: f_open on LUN image returned FR_DENIED\r\n"));
				break;
					
			case FR_EXIST:
				debugString_P(PSTR("File system: filesystemCheckLunImage(): ERROR: f_open on LUN image returned FR_EXIST\r\n"));
				break;
					
			case FR_INVALID_OBJECT:
				debugString_P(PSTR("File system: filesystemCheckLunImage(): ERROR: f_open on LUN image returned FR_INVALID_OBJECT\r\n"));
				break;
					
			case FR_WRITE_PROTECTED:
				debugString_P(PSTR("File system: filesystemCheckLunImage(): ERROR: f_open on LUN image returned FR_WRITE_PROTECTED\r\n"));
				break;
					
			case FR_INVALID_DRIVE:
				debugString_P(PSTR("File system: filesystemCheckLunImage(): ERROR: f_open on LUN image returned FR_INVALID_DRIVE\r\n"));
				break;
					
			case FR_NOT_ENABLED:
				debugString_P(PSTR("File system: filesystemCheckLunImage(): ERROR: f_open on LUN image returned FR_NOT_ENABLED\r\n"));
				break;
					
			case FR_NO_FILESYSTEM:
				debugString_P(PSTR("File system: filesystemCheckLunImage(): ERROR: f_open on LUN image returned FR_NO_FILESYSTEM\r\n"));
				break;
					
			case FR_TIMEOUT:
				debugString_P(PSTR("File system: filesystemCheckLunImage(): ERROR: f_open on LUN image returned FR_TIMEOUT\r\n"));
				break;
					
			case FR_LOCKED:
				debugString_P(PSTR("File system: filesystemCheckLunImage(): ERROR: f_open on LUN image returned FR_LOCKED\r\n"));
				break;
					
			case FR_NOT_ENOUGH_CORE:
				debugString_P(PSTR("File system: filesystemCheckLunImage(): ERROR: f_open on LUN image returned FR_NOT_ENOUGH_CORE\r\n"));
				break;
					
			case FR_TOO_MANY_OPEN_FILES:
				debugString_P(PSTR("File system: filesystemCheckLunImage(): ERROR: f_open on LUN image returned FR_TOO_MANY_OPEN_FILES\r\n"));
				break;
					
			default:
				debugString_P(PSTR("File system: filesystemCheckLunImage(): ERROR: f_open on LUN image returned Funknown error\r\n"));
				break;
			}
		}
		
		// Exit with error
		f_close(&filesystemState.fileObject);
		return false;
	}

	// Opening the LUN image was successful
	if(debugFlag_filesystem) debugString_P(PSTR("File system: filesystemCheckLunImage(): LUN image found\r\n"));
			
	// Get the size of the LUN image in bytes
	lunFileSize = (uint32_t)f_size(&filesystemState.fileObject);
	if (debugFlag_filesystem) debugStringInt32_P(PSTR("File system: filesystemCheckLunImage(): LUN size in bytes (according to .dat) = "), lunFileSize, 1);
			
	// Check that the LUN file size is actually a size which ADFS can support (the number of sectors is limited to a 21 bit number)
	// i.e. a maximum of 0x1FFFFF or 2,097,151 (* 256 bytes per sector = 512Mb = 536,870,656 bytes)
	if(lunFileSize > 536870656)
	{
		if (debugFlag_filesystem) debugString_P(PSTR("File system: filesystemCheckLunImage(): WARNING: The LUN file size is greater than 512Mbs\r\n"));
	}
			
	// Close the LUN image file
	f_close(&filesystemState.fileObject);
			
	// Check if the LUN descriptor file (.dsc) is present
	sprintf(fileName, "/BeebSCSI%d/scsi%d.dsc", filesystemState.lunDirectory, lunNumber);
			
	if (debugFlag_filesystem) debugStringInt16_P(PSTR("File system: filesystemCheckLunImage(): Checking for (.dsc) LUN descriptor "), (uint16_t)lunNumber, 1);
	filesystemState.fsResult = f_open(&filesystemState.fileObject, fileName, FA_READ);
			
	
	if (filesystemState.fsResult != FR_OK)
	{
		// LUN descriptor file is not found
		if(debugFlag_filesystem) debugString_P(PSTR("File system: filesystemCheckLunImage(): LUN descriptor not found\r\n"));
		f_close(&filesystemState.fileObject);
				
		// Automatically create a LUN descriptor file for the LUN image
		if(filesystemCreateDscFromLunImage(filesystemState.lunDirectory, lunNumber, lunFileSize))
		{
			if (debugFlag_filesystem) debugString_P(PSTR("File system: filesystemCheckLunImage(): Automatically created .dsc for LUN image\r\n"));
		}
		else
		{
			if (debugFlag_filesystem) debugString_P(PSTR("File system: filesystemCheckLunImage(): ERROR: Automatically creating .dsc for LUN image failed\r\n"));
		}
	}
	else
	{
		// LUN descriptor file is present
		if(debugFlag_filesystem) debugString_P(PSTR("File system: filesystemCheckLunImage(): LUN descriptor found\r\n"));
		f_close(&filesystemState.fileObject);
				
