pgodwin/LC-SCSI/src/LCSCSI-STM32/filesystem.c
		// Calculate the LUN size from the descriptor file
		lunDscSize = filesystemGetLunSizeFromDsc(filesystemState.lunDirectory, lunNumber);
		if (debugFlag_filesystem) debugStringInt32_P(PSTR("File system: filesystemCheckLunImage(): LUN size in bytes (according to .dsc) = "), lunDscSize, 1);
				
		// Are the file size and DSC size consistent?
		if(lunDscSize != lunFileSize)
		{
			if (debugFlag_filesystem) debugString_P(PSTR("File system: filesystemCheckLunImage(): WARNING: File size and DSC parameters are NOT consistent\r\n"));
		}
	}
	
	// Check if the LUN user code descriptor file (.ucd) is present
	sprintf(fileName, "/BeebSCSI%d/scsi%d.ucd", filesystemState.lunDirectory, lunNumber);
	
	if (debugFlag_filesystem) debugString_P(PSTR("File system: filesystemCheckLunImage(): Checking for (.ucd) LUN user code descriptor\r\n"));
	filesystemState.fsResult = f_open(&filesystemState.fileObject, fileName, FA_READ);
	
	if (filesystemState.fsResult != FR_OK)
	{
		// LUN descriptor file is not found
		if(debugFlag_filesystem) debugString_P(PSTR("File system: filesystemCheckLunImage(): LUN user code descriptor not found\r\n"));
		f_close(&filesystemState.fileObject);
		
		// Set the user code descriptor to the default (probably not a laser disc image)
		filesystemState.fsLunUserCode[lunNumber][0] = 0x00;
		filesystemState.fsLunUserCode[lunNumber][1] = 0x00;
		filesystemState.fsLunUserCode[lunNumber][2] = 0x00;
		filesystemState.fsLunUserCode[lunNumber][3] = 0x00;
		filesystemState.fsLunUserCode[lunNumber][4] = 0x00;
	}
	else
	{
		// LUN user code descriptor file is present
		if(debugFlag_filesystem) debugString_P(PSTR("File system: filesystemCheckLunImage(): LUN user code descriptor found\r\n"));
		
		// Close the .ucd file
		f_close(&filesystemState.fileObject);
		
		// Read the user code from the .ucd file
		filesystemGetUserCodeFromUcd(filesystemState.lunDirectory, lunNumber);
	}
	
	// Exit with success
	if(debugFlag_filesystem) debugString_P(PSTR("File system: filesystemCheckLunImage(): Successful\r\n"));
	return true;
}

// Function to calculate the LUN image size from the LUN descriptor file parameters
uint32_t filesystemGetLunSizeFromDsc(uint8_t lunDirectory, uint8_t lunNumber)
{
	uint32_t lunSize = 0;
	uint16_t fsCounter;
	
	uint32_t blockSize;
	uint32_t cylinderCount;
	uint32_t dataHeadCount;
	
	// Assemble the DSC file name
	sprintf(fileName, "/BeebSCSI%d/scsi%d.dsc", lunDirectory, lunNumber);
		
	filesystemState.fsResult = f_open(&filesystemState.fileObject, fileName, FA_READ);
	if (filesystemState.fsResult == FR_OK)
	{
		// Read the DSC data
		filesystemState.fsResult = f_read(&filesystemState.fileObject, sectorBuffer, 22, &fsCounter);
			
		// Check that the file was read OK and is the correct length
		if(filesystemState.fsResult != FR_OK  && fsCounter == 22)
		{
			// Something went wrong
			if(debugFlag_filesystem) debugString_P(PSTR("File system: filesystemGetLunSizeFromDsc(): ERROR: Could not read .dsc file\r\n"));
			f_close(&filesystemState.fileObject);
			return 0;
		}
		
		// Interpret the DSC information and calculate the LUN size
		if(debugFlag_filesystem) debugLunDescriptor(sectorBuffer);
		
		blockSize = (((uint32_t)sectorBuffer[9] << 16) + ((uint32_t)sectorBuffer[10] << 8) + (uint32_t)sectorBuffer[11]);
		cylinderCount = (((uint32_t)sectorBuffer[13] << 8) + (uint32_t)sectorBuffer[14]);
		dataHeadCount =  (uint32_t)sectorBuffer[15];

		if (debugFlag_filesystem) debugStringInt32_P(PSTR("File system: filesystemGetLunSizeFromDsc(): Block Size:"), blockSize, true);
		
		// Note:
		//
		// The drive size (actual data storage) is calculated by the following formula:
		//
		// tracks = heads * cylinders
		// sectors = tracks * 33
		// (the '33' is because SuperForm uses a 2:1 interleave format with 33 sectors per
		// track (F-2 in the ACB-4000 manual))
		// bytes = sectors * block size (block size is always 256 bytes)
		lunSize = ((dataHeadCount * cylinderCount) * 33) * blockSize;
		f_close(&filesystemState.fileObject);
	}
	
	return lunSize;
}

// Function to automatically create a DSC file based on the file size of the LUN image
// Note, this function is specific to the BBC Micro and the ACB-4000 host adapter card
// If the DSC is inaccurate then, for the BBC Micro, it's not that important, since the 
// host only looks at its own file system data (Superform and other formatters use the DSC
// information though... so beware).
bool filesystemCreateDscFromLunImage(uint8_t lunDirectory, uint8_t lunNumber, uint32_t lunFileSize)
{
	uint32_t cylinders;
	uint32_t heads;
	uint16_t fsCounter;
	
	// Calculate the LUN file size in tracks (33 sectors per track, 256 bytes per sector)
	
	// Check that the LUN file size is actually a size which ADFS can support (the number of sectors is limited to a 21 bit number)
	// i.e. a maximum of 0x1FFFFF or 2,097,151 (* 256 bytes per sector = 512Mb = 536,870,656 bytes)
	if(lunFileSize > 536870656)
	{
		if (debugFlag_filesystem) debugString_P(PSTR("File system: filesystemCreateDscFromLunImage(): WARNING: The LUN file size is greater than 512Mbs\r\n"));
	}
	
	// Check that the LUN file size is actually a size which the ACB-4000 card could have supported (given that the 
	// block and track sizes were fixed to 256 and 33 respectively)
	if(lunFileSize % (SECTOR_SIZE * 33) != 0)
	{
		if (debugFlag_filesystem) debugString_P(PSTR("File system: filesystemCreateDscFromLunImage(): WARNING: The LUN file size could not be supported by an ACB-4000 card\r\n"));
	}
	lunFileSize = lunFileSize / (33 * SECTOR_SIZE);
	
	// The lunFileSize (in tracks) should be evenly divisible by the head count and the head count should be
	// 16 or less.
	heads = 16;
	while ((lunFileSize % heads != 0) && heads != 1) heads--;
	cylinders = lunFileSize / heads;
	
	if (debugFlag_filesystem) debugStringInt32_P(PSTR("File system: filesystemCreateDscFromLunImage(): LUN size in tracks (33 * 512 bytes) = "), lunFileSize, true);
	if (debugFlag_filesystem) debugStringInt32_P(PSTR("File system: filesystemCreateDscFromLunImage(): Number of heads = "), heads, true);
	if (debugFlag_filesystem) debugStringInt32_P(PSTR("File system: filesystemCreateDscFromLunImage(): Number of cylinders = "), cylinders, true);
	
	// The first 4 bytes are the Mode Select Parameter List (ACB-4000 manual figure 5-18)
	sectorBuffer[0] = 0; 		// Reserved (0)
	sectorBuffer[1] = 0; 		// Reserved (0)
	sectorBuffer[2] = 0; 		// Reserved (0)
	sectorBuffer[3] = 8; 		// Length of Extent Descriptor List (8)
	
	// The next 8 bytes are the Extent Descriptor list (there can only be one of these
	// and it's always 8 bytes) (ACB-4000 manual figure 5-19)
	sectorBuffer[4] = 0; 		// Density code
	sectorBuffer[5] = 0; 		// Reserved (0)
	sectorBuffer[6] = 0; 		// Reserved (0)
	sectorBuffer[7] = 0; 		// Reserved (0)
	sectorBuffer[8] = 0; 		// Reserved (0)
	sectorBuffer[9] = 0; 		// Block size MSB
	sectorBuffer[10] = 2;  		// Block size
	sectorBuffer[11] = 0; 		// Block size LSB = 512
	
	// The next 12 bytes are the Drive Parameter List (ACB-4000 manual figure 5-20)
	sectorBuffer[12] = 1; 		// List format code
	sectorBuffer[13] = (uint8_t)((cylinders & 0x0000FF00) >> 8);  // Cylinder count MSB
	sectorBuffer[14] = (uint8_t)(cylinders & 0x000000FF);  // Cylinder count LSB
	sectorBuffer[15] = (uint8_t)(heads & 0x000000FF);  // Data head count 
	sectorBuffer[16] = 0; 		// Reduced write current cylinder MSB
	sectorBuffer[17] = 128; 		// Reduced write current cylinder LSB = 128
	sectorBuffer[18] = 0; 		// Write pre-compensation cylinder MSB
	sectorBuffer[19] = 128; 		// Write pre-compensation cylinder LSB = 128
	sectorBuffer[20] = 0; 		// Landing zone position
	sectorBuffer[21] = 1; 		// Step pulse output rate code
	
	// Assemble the DSC file name
	sprintf(fileName, "/BeebSCSI%d/scsi%d.dsc", lunDirectory, lunNumber);
	
	filesystemState.fsResult = f_open(&filesystemState.fileObject, fileName, FA_CREATE_ALWAYS | FA_WRITE);
	if (filesystemState.fsResult == FR_OK)
	{
		// Write the DSC data
		filesystemState.fsResult = f_write(&filesystemState.fileObject, sectorBuffer, 22, &fsCounter);
		
