pgodwin/LC-SCSI/src/LCSCSI-STM32/filesystem.c
		// Check that the file was written OK and is the correct length
		if(filesystemState.fsResult != FR_OK  && fsCounter == 22)
		{
			// Something went wrong
			if(debugFlag_filesystem) debugString_P(PSTR("File system: filesystemCreateDscFromLunImage(): ERROR: .dsc create failed\r\n"));
			
			if (debugFlag_filesystem)
			{
				switch (filesystemState.fsResult)
				{
				case FR_DISK_ERR:
					debugString_P(PSTR("File system: filesystemCreateDscFromLunImage(): ERROR: f_write on LUN .dsc returned FR_DISK_ERR\r\n"));
					break;
					
				case FR_INT_ERR:
					debugString_P(PSTR("File system: filesystemCreateDscFromLunImage(): ERROR: f_write on LUN .dsc returned FR_INT_ERR\r\n"));
					break;
					
				case FR_DENIED:
					debugString_P(PSTR("File system: filesystemCreateDscFromLunImage(): ERROR: f_write on LUN .dsc returned FR_DENIED\r\n"));
					break;
										
				case FR_INVALID_OBJECT:
					debugString_P(PSTR("File system: filesystemCreateDscFromLunImage(): ERROR: f_write on LUN .dsc returned FR_INVALID_OBJECT\r\n"));
					break;
					
				case FR_TIMEOUT:
					debugString_P(PSTR("File system: filesystemCreateDscFromLunImage(): ERROR: f_write on LUN .dsc returned FR_TIMEOUT\r\n"));
					break;
					
				default:
					debugString_P(PSTR("File system: filesystemCreateDscFromLunImage(): ERROR: f_write on LUN .dsc returned unknown error\r\n"));
					break;
				}
			}
			
			f_close(&filesystemState.fileObject);
			return false;
		}
	}
	else
	{
		// Something went wrong
		if(debugFlag_filesystem)
		{
			switch (filesystemState.fsResult)
			{
			case FR_DISK_ERR:
				debugString_P(PSTR("File system: filesystemCreateDscFromLunImage(): ERROR: f_open on LUN .dsc returned FR_DISK_ERR\r\n"));
				break;
				
			case FR_INT_ERR:
				debugString_P(PSTR("File system: filesystemCreateDscFromLunImage(): ERROR: f_open on LUN .dsc returned FR_INT_ERR\r\n"));
				break;
				
			case FR_NOT_READY:
				debugString_P(PSTR("File system: filesystemCreateDscFromLunImage(): ERROR: f_open on LUN .dsc returned FR_NOT_READY\r\n"));
				break;

			case FR_NO_FILE:
				debugString_P(PSTR("File system: filesystemCreateDscFromLunImage(): ERROR: f_open on LUN .dsc returned FR_NO_FILE\\r\n"));
				break;
				
			case FR_NO_PATH:
				debugString_P(PSTR("File system: filesystemCreateDscFromLunImage(): ERROR: f_open on LUN .dsc returned FR_NO_PATH\r\n"));
				break;

			case FR_INVALID_NAME:
				debugString_P(PSTR("File system: filesystemCreateDscFromLunImage(): ERROR: f_open on LUN .dsc returned FR_INVALID_NAME\r\n"));
				break;

			case FR_DENIED:
				debugString_P(PSTR("File system: filesystemCreateDscFromLunImage(): ERROR: f_open on LUN .dsc returned FR_DENIED\r\n"));
				break;
				
			case FR_EXIST:
				debugString_P(PSTR("File system: filesystemCreateDscFromLunImage(): ERROR: f_open on LUN .dsc returned FR_EXIST\r\n"));
				break;
				
			case FR_INVALID_OBJECT:
				debugString_P(PSTR("File system: filesystemCreateDscFromLunImage(): ERROR: f_open on LUN .dsc returned FR_INVALID_OBJECT\r\n"));
				break;
				
			case FR_WRITE_PROTECTED:
				debugString_P(PSTR("File system: filesystemCreateDscFromLunImage(): ERROR: f_open on LUN .dsc returned FR_WRITE_PROTECTED\r\n"));
				break;
				
			case FR_INVALID_DRIVE:
				debugString_P(PSTR("File system: filesystemCreateDscFromLunImage(): ERROR: f_open on LUN .dsc returned FR_INVALID_DRIVE\r\n"));
				break;
				
			case FR_NOT_ENABLED:
				debugString_P(PSTR("File system: filesystemCreateDscFromLunImage(): ERROR: f_open on LUN .dsc returned FR_NOT_ENABLED\r\n"));
				break;
				
			case FR_NO_FILESYSTEM:
				debugString_P(PSTR("File system: filesystemCreateDscFromLunImage(): ERROR: f_open on LUN .dsc returned FR_NO_FILESYSTEM\r\n"));
				break;
				
			case FR_TIMEOUT:
				debugString_P(PSTR("File system: filesystemCreateDscFromLunImage(): ERROR: f_open on LUN .dsc returned FR_TIMEOUT\r\n"));
				break;
				
			case FR_LOCKED:
				debugString_P(PSTR("File system: filesystemCreateDscFromLunImage(): ERROR: f_open on LUN .dsc returned FR_LOCKED\r\n"));
				break;
				
			case FR_NOT_ENOUGH_CORE:
				debugString_P(PSTR("File system: filesystemCreateDscFromLunImage(): ERROR: f_open on LUN .dsc returned FR_NOT_ENOUGH_CORE\r\n"));
				break;
				
			case FR_TOO_MANY_OPEN_FILES:
				debugString_P(PSTR("File system: filesystemCreateDscFromLunImage(): ERROR: f_open on LUN .dsc returned FR_TOO_MANY_OPEN_FILES\r\n"));
				break;
				
			default:
				debugString_P(PSTR("File system: filesystemCreateDscFromLunImage(): ERROR: f_open on LUN .dsc returned unknown error\r\n"));
				break;
			}
		}
		
		f_close(&filesystemState.fileObject);
		return false;
	}
	
	// Descriptor write OK
	if(debugFlag_filesystem) debugString_P(PSTR("File system: filesystemCreateDscFromLunImage(): .dsc file created\r\n"));
	f_close(&filesystemState.fileObject);
	
	return true;
}

// Function to read the user code data from the LUN user code descriptor file (.ucd)
void filesystemGetUserCodeFromUcd(uint8_t lunDirectoryNumber, uint8_t lunNumber)
{
	uint16_t fsCounter;
	
	// Assemble the UCD file name
	sprintf(fileName, "/BeebSCSI%d/scsi%d.ucd", lunDirectoryNumber, lunNumber);
	
	filesystemState.fsResult = f_open(&filesystemState.fileObject, fileName, FA_READ);
	if (filesystemState.fsResult == FR_OK)
	{
		// Read the DSC data
		filesystemState.fsResult = f_read(&filesystemState.fileObject, filesystemState.fsLunUserCode[lunNumber], 5, &fsCounter);
		
		// Check that the file was read OK and is the correct length
		if(filesystemState.fsResult != FR_OK  && fsCounter == 5)
		{
			// Something went wrong
			if(debugFlag_filesystem) debugString_P(PSTR("File system: filesystemGetUserCodeFromUcd(): ERROR: Could not read .ucd file\r\n"));
			f_close(&filesystemState.fileObject);
			return;
		}

		if (debugFlag_filesystem)
		{
			debugStringInt16_P(PSTR("File system: filesystemGetUserCodeFromUcd(): User code bytes (from .ucd): "), (uint16_t)filesystemState.fsLunUserCode[lunNumber][0], false);
			debugStringInt16_P(PSTR(", "), (uint16_t)filesystemState.fsLunUserCode[lunNumber][1], false);
			debugStringInt16_P(PSTR(", "), (uint16_t)filesystemState.fsLunUserCode[lunNumber][2], false);
			debugStringInt16_P(PSTR(", "), (uint16_t)filesystemState.fsLunUserCode[lunNumber][3], false);
			debugStringInt16_P(PSTR(", "), (uint16_t)filesystemState.fsLunUserCode[lunNumber][4], true);
		}

		f_close(&filesystemState.fileObject);
	}
}

// Function to set the current LUN directory (for the LUN jukeboxing functionality)
void filesystemSetLunDirectory(uint8_t lunDirectoryNumber)
{
	// Change the current LUN directory number
	filesystemState.lunDirectory = lunDirectoryNumber;
	
	// Set all LUNs to stopped
	filesystemSetLunStatus(0, false);
	filesystemSetLunStatus(1, false);
	filesystemSetLunStatus(2, false);
	filesystemSetLunStatus(3, false);
	filesystemSetLunStatus(4, false);
	filesystemSetLunStatus(5, false);
	filesystemSetLunStatus(6, false);
	filesystemSetLunStatus(7, false);
}

// Function to read the current LUN directory (for the LUN jukeboxing functionality)
uint8_t filesystemGetLunDirectory(void)
{
	return filesystemState.lunDirectory;
}

// Functions for creating LUNs and LUN descriptors ------------------------------------------------------------------------------------------------------------

// Function to create a new LUN image (makes an empty .dat file)
bool filesystemCreateLunImage(uint8_t lunNumber)
{
	// Assemble the .dat file name
	sprintf(fileName, "/BeebSCSI%d/scsi%d.dat", filesystemState.lunDirectory, lunNumber);
	
	filesystemState.fsResult = f_open(&filesystemState.fileObject, fileName, FA_READ);
	if (filesystemState.fsResult == FR_OK)
	{
		// File opened ok - which means it already exists...
		if(debugFlag_filesystem) debugString_P(PSTR("File system: filesystemCreateLunImage(): .dat already exists - ignoring request to create a new .dat\r\n"));
		f_close(&filesystemState.fileObject);
		return true;
	}
	
