pgodwin/LC-SCSI/src/LCSCSI-STM32/filesystem.c
	// Create a new .dat file
	filesystemState.fsResult = f_open(&filesystemState.fileObject, fileName, FA_CREATE_NEW);
	if (filesystemState.fsResult != FR_OK)
	{
		// Create .dat file failed
		if(debugFlag_filesystem) debugString_P(PSTR("File system: filesystemCreateLunImage(): ERROR: Could not create new .dat file!\r\n"));
		f_close(&filesystemState.fileObject);
		return false;
	}
	
	// LUN .dat file created successfully
	f_close(&filesystemState.fileObject);
	if (debugFlag_filesystem) debugString_P(PSTR("File system: filesystemCreateLunImage(): Successful\r\n"));
	return true;
}

// Function to create a new LUN descriptor (makes an empty .dsc file)
bool filesystemCreateLunDescriptor(uint8_t lunNumber)
{
	// Assemble the .dsc file name
	sprintf(fileName, "/BeebSCSI%d/scsi%d.dsc", filesystemState.lunDirectory, lunNumber);
	
	filesystemState.fsResult = f_open(&filesystemState.fileObject, fileName, FA_READ);
	if (filesystemState.fsResult == FR_OK)
	{
		// File opened ok - which means it already exists...
		if(debugFlag_filesystem) debugString_P(PSTR("File system: filesystemCreateLunDescriptor(): .dsc already exists - ignoring request to create a new .dsc\r\n"));
		f_close(&filesystemState.fileObject);
		return true;
	}
	
	// Create a new .dsc file
	filesystemState.fsResult = f_open(&filesystemState.fileObject, fileName, FA_CREATE_NEW);
	if (filesystemState.fsResult != FR_OK)
	{
		// Create .dsc file failed
		if(debugFlag_filesystem) debugString_P(PSTR("File system: filesystemCreateLunDescriptor(): ERROR: Could not create new .dsc file!\r\n"));
		f_close(&filesystemState.fileObject);
		return false;
	}
	
	// LUN DSC file created successfully
	f_close(&filesystemState.fileObject);
	if (debugFlag_filesystem) debugString_P(PSTR("File system: filesystemCreateLunDescriptor(): Successful\r\n"));
	return true;
}

// Function to read a LUN descriptor
bool filesystemReadLunDescriptor(uint8_t lunNumber, uint8_t buffer[])
{
	// Assemble the .dsc file name
	sprintf(fileName, "/BeebSCSI%d/scsi%d.dsc", filesystemState.lunDirectory, lunNumber);
	
	filesystemState.fsResult = f_open(&filesystemState.fileObject, fileName, FA_READ);
	if (filesystemState.fsResult == FR_OK)
	{
		// Read the .dsc data
		filesystemState.fsResult = f_read(&filesystemState.fileObject, buffer, 22, &filesystemState.fsCounter);
		
		// Check that the file was read OK and is the correct length
		if(filesystemState.fsResult != FR_OK  && filesystemState.fsCounter == 22)
		{
			// Something went wrong
			if(debugFlag_filesystem) debugString_P(PSTR("File system: filesystemReadLunDescriptor(): ERROR: Could not read .dsc file for LUN\r\n"));
			f_close(&filesystemState.fileObject);
			return false;
		}
	}
	else
	{
		// Looks like the .dsc file is not present on the file system
		debugStringInt16_P(PSTR("File system: filesystemReadLunDescriptor(): ERROR: Could not open .dsc file for LUN "), lunNumber, true);
		f_close(&filesystemState.fileObject);
		return false;
	}
	
	// Descriptor read OK
	f_close(&filesystemState.fileObject);
	if (debugFlag_filesystem) debugString_P(PSTR("File system: filesystemReadLunDescriptor(): Successful\r\n"));
	return true;
}

// Function to write a LUN descriptor
bool filesystemWriteLunDescriptor(uint8_t lunNumber, uint8_t buffer[])
{
	
	// Assemble the .dsc file name
	sprintf(fileName, "/BeebSCSI%d/scsi%d.dsc", filesystemState.lunDirectory, lunNumber);
	
	filesystemState.fsResult = f_open(&filesystemState.fileObject, fileName, FA_READ | FA_WRITE);
	if (filesystemState.fsResult == FR_OK)
	{
		// Write the .dsc data
		filesystemState.fsResult = f_write(&filesystemState.fileObject, buffer, 22, &filesystemState.fsCounter);
		
		// Check that the file was written OK and is the correct length
		if(filesystemState.fsResult != FR_OK  && filesystemState.fsCounter == 22)
		{
			// Something went wrong
			if(debugFlag_filesystem) debugString_P(PSTR("File system: filesystemWriteLunDescriptor(): ERROR: Could not write .dsc file for LUN\r\n"));
			f_close(&filesystemState.fileObject);
			return false;
		}
	}
	else
	{
		// Looks like the .dsc file is not present on the file system
		debugStringInt16_P(PSTR("File system: filesystemWriteLunDescriptor(): ERROR: Could not open .dsc file for LUN "), lunNumber, true);
		f_close(&filesystemState.fileObject);
		return false;
	}
	
	// Descriptor write OK
	f_close(&filesystemState.fileObject);
	if (debugFlag_filesystem) debugString_P(PSTR("File system: filesystemWriteLunDescriptor(): Successful\r\n"));
	return true;
}

// Function to format a LUN image
bool filesystemFormatLun(uint8_t lunNumber, uint8_t dataPattern)
{
	uint32_t requiredNumberOfSectors = 0;
	
	if (debugFlag_filesystem) debugStringInt16_P(PSTR("File system: filesystemFormatLun(): Formatting LUN image "), lunNumber, true);
	
	// Read the LUN descriptor for the LUN image into the sector buffer
	if(!filesystemReadLunDescriptor(lunNumber, sectorBuffer))
	{
		// Unable to read the LUN descriptor
		if(debugFlag_filesystem) debugString_P(PSTR("File system: filesystemFormatLun(): ERROR: Could not read .dsc file for LUN\r\n"));
		return false;
	}
	
	// Calculate the number of 256 byte sectors required to fulfill the drive geometry
	// tracks = heads * cylinders
	// sectors = tracks * 33
	requiredNumberOfSectors = ((uint32_t)sectorBuffer[15] * (((uint32_t)sectorBuffer[13] << 8) + (uint32_t)sectorBuffer[14])) * 33;
	if (debugFlag_filesystem) debugStringInt32_P(PSTR("File system: filesystemFormatLun(): Sectors required = "), requiredNumberOfSectors, true);
	
	// Assemble the .dat file name
	sprintf(fileName, "/BeebSCSI%d/scsi%d.dat", filesystemState.lunDirectory, lunNumber);
	
	// Note: We are using the expand FAT method to create the LUN image... the dataPattern byte
	// will be ignored.
	// Fill the sector buffer with the required data pattern
	// for (counter = 0; counter < 256; counter++) sectorBuffer[counter] = dataPattern;
	
	// Create the .dat file (the old .dat file, if present, will be unlinked (i.e. gone forever))
	filesystemState.fsResult = f_open(&filesystemState.fileObject, fileName, FA_READ | FA_WRITE | FA_CREATE_ALWAYS);
	if (filesystemState.fsResult == FR_OK)
	{
		// Write the required number of sectors to the DAT file
		if(debugFlag_filesystem) debugString_P(PSTR("File system: filesystemFormatLun(): Performing format...\r\n"));
		
		// If we try to write 512MBs of data to the SD card in 256 byte chunks
		// via SPI it will take a very long time to complete...
		//
		// So instead we use the FAT FS expand command to allocate a file of the required
		// LUN size
		//
		// Note: This allocates a contiguous area for the file which can help to
		// speed up read/write times.  If you would prefer the file to be small
		// and grow as used, just remove the f_expand and the fsResult check.  Every
		// thing will work fine without them.
		//
		// This ignores the data pattern (since the file is only allocated - not
		// actually written).
		filesystemState.fsResult = f_expand(&filesystemState.fileObject, (FSIZE_t)(requiredNumberOfSectors * SECTOR_SIZE), 1);
		
		if (debugFlag_filesystem) debugString_P(PSTR("File system: filesystemFormatLun(): Format complete\r\n"));
		
		// Check that the file was written OK
		if(filesystemState.fsResult != FR_OK)
		{
			// Something went wrong writing to the .dat
			if(debugFlag_filesystem) debugString_P(PSTR("File system: filesystemFormatLun(): ERROR: Could not write .dat\r\n"));
			f_close(&filesystemState.fileObject);
			return false;
		}
	}
	else
	{
		// Something went wrong opening the .dat
		if(debugFlag_filesystem) debugString_P(PSTR("File system: filesystemFormatLun(): ERROR: Could not open .dat\r\n"));
		f_close(&filesystemState.fileObject);
		return false;
	}
	
	// Formatting successful
	f_close(&filesystemState.fileObject);
	if (debugFlag_filesystem) debugString_P(PSTR("File system: filesystemFormatLun(): Successful\r\n"));
	return true;
}

// Functions for reading and writing LUN images ---------------------------------------------------------------------------------------------------------------

// Function to open a LUN ready for reading
// Note: The read functions use a multi-sector buffer to lower the number of required
// reads from the physical media.  This is to allow more efficient (larger) reads of data.
bool filesystemOpenLunForRead(uint8_t lunNumber, uint32_t startSector, uint32_t requiredNumberOfSectors)
{
	uint32_t sectorsToRead = 0;
	
	// Ensure there isn't already a LUN image open
	if(lunOpenFlag)
	{
		if (debugFlag_filesystem) debugString_P(PSTR("File system: filesystemOpenLunForRead(): ERROR: LUN image already open!\r\n"));
		return false;	
	}
	
	// Assemble the .dat file name
	sprintf(fileName, "/BeebSCSI%d/scsi%d.dat", filesystemState.lunDirectory, lunNumber);

	// Open the DAT file
	filesystemState.fsResult = f_open(&filesystemState.fileObject, fileName, FA_READ);
	if (filesystemState.fsResult == FR_OK)
	{
		// Move to the correct point in the DAT file
		// This is * SECTOR_SIZE as each block is 512 bytes
		filesystemState.fsResult = f_lseek(&filesystemState.fileObject, startSector * SECTOR_SIZE);

		// Check that the file seek was OK
		if(filesystemState.fsResult != FR_OK)
		{
			// Something went wrong with seeking, do not retry
			if(debugFlag_filesystem) debugString_P(PSTR("File system: filesystemOpenLunForRead(): ERROR: Unable to seek to required sector in LUN image file!\r\n"));
			f_close(&filesystemState.fileObject);
			return false;
		}
	}
	
	// Fill the file system sector buffer
	sectorsToRead = requiredNumberOfSectors;
	if (sectorsToRead > SECTOR_BUFFER_LENGTH) sectorsToRead = SECTOR_BUFFER_LENGTH;
	
