pgodwin/LC-SCSI/src/LCSCSI-STM32/filesystem.c
	sectorsInBuffer = sectorsToRead;
	currentBufferSector = 0;
	sectorsRemaining = requiredNumberOfSectors - sectorsInBuffer;
	
	// Read the required data into the sector buffer
	filesystemState.fsResult = f_read(&filesystemState.fileObject, sectorBuffer, sectorsToRead * SECTOR_SIZE, &filesystemState.fsCounter);
	
	// Check that the file was read OK
	if(filesystemState.fsResult != FR_OK)
	{
		// Something went wrong
		if(debugFlag_filesystem) debugString_P(PSTR("File system: filesystemReadNextSector(): ERROR: Cannot read from LUN image!\r\n"));
		f_close(&filesystemState.fileObject);
		return false;
	}

	// Exit with success
	lunOpenFlag = true;
	if (debugFlag_filesystem) debugString_P(PSTR("File system: filesystemOpenLunForRead(): Successful\r\n"));
	return true;
}

// Function to read next sector from a LUN
bool filesystemReadNextSector(uint8_t buffer[])
{
	//uint16_t byteCounter;
	uint32_t sectorsToRead = 0;
	
	// Ensure there is a LUN image open
	if(!lunOpenFlag)
	{
		if (debugFlag_filesystem) debugString_P(PSTR("File system: filesystemReadNextSector(): ERROR: No LUN image open!\r\n"));
		return false;
	}
	
	// Is the required sector already in the sector buffer?
	if(currentBufferSector < sectorsInBuffer)
	{
		// Fill the function buffer from the sector buffer
		memcpy(buffer, sectorBuffer + (currentBufferSector * SECTOR_SIZE), SECTOR_SIZE);
		
		// Move to the next sector
		currentBufferSector++;
	}
	
	// Refill the sector buffer?
	if(currentBufferSector == sectorsInBuffer)
	{
		// Ensure we have sectors remaining to be read
		if(sectorsRemaining != 0)
		{
			sectorsToRead = sectorsRemaining;
			if (sectorsRemaining > SECTOR_BUFFER_LENGTH) sectorsToRead = SECTOR_BUFFER_LENGTH;
			
			sectorsInBuffer = sectorsToRead;
			currentBufferSector = 0;
			sectorsRemaining = sectorsRemaining - sectorsInBuffer;
			
			// Read the required data into the sector buffer
			filesystemState.fsResult = f_read(&filesystemState.fileObject, sectorBuffer, sectorsToRead * SECTOR_SIZE, &filesystemState.fsCounter);
			
			// Check that the file was read OK
			if(filesystemState.fsResult != FR_OK)
			{
				// Something went wrong
				if(debugFlag_filesystem) debugString_P(PSTR("File system: filesystemReadNextSector(): ERROR: Cannot read from LUN image!\r\n"));
				f_close(&filesystemState.fileObject);
				return false;
			}
		}
	}
	
	// Exit with success
	return true;
}

// Function to close a LUN for reading
bool filesystemCloseLunForRead(void)
{
	// Ensure there is a LUN image open
	if(!lunOpenFlag)
	{
		if (debugFlag_filesystem) debugString_P(PSTR("File system: filesystemCloseLunForRead(): ERROR: No LUN image open!\r\n"));
		return false;
	}
	
	// Close the open file object
	f_close(&filesystemState.fileObject);
	lunOpenFlag = false;
	if (debugFlag_filesystem) debugString_P(PSTR("File system: filesystemCloseLunForRead(): Completed\r\n"));
	return false;
}

// Function to open a LUN ready for writing
bool filesystemOpenLunForWrite(uint8_t lunNumber, uint32_t startSector, uint32_t requiredNumberOfSectors)
{
	// Ensure there isn't already a LUN image open
	if(lunOpenFlag)
	{
		if (debugFlag_filesystem) debugString_P(PSTR("File system: filesystemOpenLunForWrite(): ERROR: LUN image already open!\r\n"));
		return false;
	}
	
	// Assemble the .dat file name
	sprintf(fileName, "/BeebSCSI%d/scsi%d.dat", filesystemState.lunDirectory, lunNumber);

	// Open the DAT file
	filesystemState.fsResult = f_open(&filesystemState.fileObject, fileName, FA_READ | FA_WRITE);
	if (filesystemState.fsResult == FR_OK)
	{
		// Move to the correct point in the DAT file
		// This is * 512 as each block is 512 bytes
		filesystemState.fsResult = f_lseek(&filesystemState.fileObject, startSector * SECTOR_SIZE);

		// Check that the file seek was OK
		if(filesystemState.fsResult != FR_OK)
		{
			// Something went wrong with seeking, do not retry
			if(debugFlag_filesystem) debugString_P(PSTR("File system: filesystemOpenLunForWrite(): ERROR: Unable to seek to required sector in LUN image file!\r\n"));
			f_close(&filesystemState.fileObject);
			return false;
		}
	}

	// Exit with success
	lunOpenFlag = true;
	if (debugFlag_filesystem) debugString_P(PSTR("File system: filesystemOpenLunForWrite(): Successful\r\n"));
	return true;
}

// Function to write next sector to a LUN
bool filesystemWriteNextSector(uint8_t buffer[])
{
	// Ensure there is a LUN image open
	if(!lunOpenFlag)
	{
		if (debugFlag_filesystem) debugString_P(PSTR("File system: filesystemWriteNextSector(): ERROR: No LUN image open!\r\n"));
		return false;
	}
	
	// Write the required data
	filesystemState.fsResult = f_write(&filesystemState.fileObject, buffer, SECTOR_SIZE, &filesystemState.fsCounter);
	
	// Check that the file was written OK
	if(filesystemState.fsResult != FR_OK)
	{
		// Something went wrong
		if(debugFlag_filesystem) debugString_P(PSTR("File system: filesystemWriteNextSector(): ERROR: Cannot write to LUN image!\r\n"));
		f_close(&filesystemState.fileObject);
		return false;
	}
	
	// Exit with success
	return true;
}

// Function to close a LUN for writing
bool filesystemCloseLunForWrite(void)
{
	// Ensure there is a LUN image open
	if(!lunOpenFlag)
	{
		if (debugFlag_filesystem) debugString_P(PSTR("File system: filesystemCloseLunForWrite(): ERROR: No LUN image open!\r\n"));
		return false;
	}
	
	// Close the open file object
	f_close(&filesystemState.fileObject);
	lunOpenFlag = false;
	if (debugFlag_filesystem) debugString_P(PSTR("File system: filesystemCloseLunForWrite(): Completed\r\n"));
	return false;
}


// Functions for FAT Transfer support --------------

// Change the filesystem's FAT transfer directory
bool filesystemSetFatDirectory(uint8_t *buffer)
{
	sprintf(fatDirectory, "%s", buffer);
	if (debugFlag_filesystem) debugString_P(PSTR("File system: filesystemSetFatDirectory(): FAT transfer directory changed to: "));
	if (debugFlag_filesystem) debugString(fatDirectory);
	if (debugFlag_filesystem) debugString_P(PSTR("\r\n"));
	
	return true;
}


// Read an entry from the FAT directory and place the information about the entry into the buffer
//
// The buffer format is as follows:
// Byte 0: Status of file (0 = does not exist, 1 = file exists, 2 = directory)
// Byte 1 - 4: Size of file in number of bytes (32-bit)
// Byte 5 - 126: Reserved (0)
// Byte 127- 255: File name string terminated with 0x00 (NULL)
//
bool filesystemGetFatFileInfo(uint32_t fileNumber, uint8_t *buffer)
{
	uint16_t byteCounter;
	uint32_t fileEntryNumber;
	
	// Is the file system mounted?
	if(filesystemState.fsMountState == false)
	{
		if (debugFlag_filesystem) debugString_P(PSTR("File system: filesystemGetFatFileInfo(): ERROR: No file system mounted\r\n"));
		return false;
	}
	
	// Clear the buffer
	for(byteCounter = 0 ; byteCounter < SECTOR_SIZE ; byteCounter++) buffer[byteCounter] = 0;
	
	// Open the FAT transfer directory
	filesystemState.fsResult = f_opendir(&filesystemState.dirObject, fatDirectory);
	
	// Check the result
	if(filesystemState.fsResult != FR_OK)
	{
		switch (filesystemState.fsResult)
		{
		case FR_NO_PATH:
			if (debugFlag_filesystem) debugString_P(PSTR("File system: filesystemCheckFatDirectory(): f_opendir returned FR_NO_PATH - Directory does not exist\r\n"));
			break;
			
		case FR_DISK_ERR:
			if (debugFlag_filesystem) debugString_P(PSTR("File system: filesystemCheckFatDirectory(): ERROR: f_opendir returned FR_DISK_ERR\r\n"));
			return false;
			break;
			
		case FR_INT_ERR:
			if (debugFlag_filesystem) debugString_P(PSTR("File system: filesystemCheckFatDirectory(): ERROR: f_opendir returned FR_INT_ERR\r\n"));
			return false;
			break;
			
		case FR_INVALID_NAME:
			if (debugFlag_filesystem) debugString_P(PSTR("File system: filesystemCheckFatDirectory(): ERROR: f_opendir returned FR_INVALID_NAME\r\n"));
			return false;
			break;
			
