pgodwin/LC-SCSI/src/LCSCSI-STM32/filesystem.c
		case FR_INVALID_OBJECT:
			if (debugFlag_filesystem) debugString_P(PSTR("File system: filesystemCheckFatDirectory(): ERROR: f_opendir returned FR_INVALID_OBJECT\r\n"));
			return false;
			break;
			
		case FR_INVALID_DRIVE:
			if (debugFlag_filesystem) debugString_P(PSTR("File system: filesystemCheckFatDirectory(): ERROR: f_opendir returned FR_INVALID_DRIVE\r\n"));
			return false;
			break;
			
		case FR_NOT_ENABLED:
			if (debugFlag_filesystem) debugString_P(PSTR("File system: filesystemCheckFatDirectory(): ERROR: f_opendir returned FR_NOT_ENABLED\r\n"));
			return false;
			break;
			
		case FR_NO_FILESYSTEM:
			if (debugFlag_filesystem) debugString_P(PSTR("File system: filesystemCheckFatDirectory(): ERROR: f_opendir returned FR_NO_FILESYSTEM\r\n"));
			return false;
			break;
			
		case FR_TIMEOUT:
			if (debugFlag_filesystem) debugString_P(PSTR("File system: filesystemCheckFatDirectory(): ERROR: f_opendir returned FR_TIMEOUT\r\n"));
			return false;
			break;
			
		case FR_NOT_ENOUGH_CORE:
			if (debugFlag_filesystem) debugString_P(PSTR("File system: filesystemCheckFatDirectory(): ERROR: f_opendir returned FR_NOT_ENOUGH_CORE\r\n"));
			return false;
			break;
			
		case FR_TOO_MANY_OPEN_FILES:
			if (debugFlag_filesystem) debugString_P(PSTR("File system: filesystemCheckFatDirectory(): ERROR: f_opendir returned FR_TOO_MANY_OPEN_FILES\r\n"));
			return false;
			break;
			
		default:
			if (debugFlag_filesystem) debugString_P(PSTR("File system: filesystemCheckFatDirectory(): ERROR: f_opendir returned unknown error\r\n"));
			return false;
			break;
		}
	}
	
	// Did a directory exist?
	if(filesystemState.fsResult == FR_NO_PATH)
	{
		f_closedir(&filesystemState.dirObject);
		
		// Create the FAT transfer directory - it's not present on the SD card
		filesystemState.fsResult = f_mkdir(fatDirectory);
		
		// Now open the directory
		filesystemState.fsResult = f_opendir(&filesystemState.dirObject, fatDirectory);
		
		// Check the result
		if(filesystemState.fsResult != FR_OK)
		{
			if (debugFlag_filesystem) debugString_P(PSTR("File system: filesystemCheckLunDirectory(): ERROR: Unable to create FAT transfer directory\r\n"));
			f_closedir(&filesystemState.dirObject);
			return false;
		}
		
		if (debugFlag_filesystem) debugString_P(PSTR("File system: filesystemCheckFatDirectory(): Created FAT transfer directory entry\r\n"));
	}
	else
	{
		if (debugFlag_filesystem) debugString_P(PSTR("File system: filesystemCheckFatDirectory(): FAT transfer directory found\r\n"));
	}
	
	// Get the requested file entry number object	
	for(fileEntryNumber = 0 ; fileEntryNumber <= fileNumber ; fileEntryNumber++)
	{
		filesystemState.fsResult = f_readdir(&filesystemState.dirObject, &filesystemState.fsInfo);
			
		// Exit on error or end of directory object entries
		if(filesystemState.fsResult != FR_OK || filesystemState.fsInfo.fname[0] == 0)
		{
			// The requested directory entry does not exist
			if(debugFlag_filesystem) debugString_P(PSTR("File system: filesystemGetFatFileInfo(): Requested directory entry does not exist\r\n"));
			buffer[0] = 0;  // file does not exist
			f_closedir(&filesystemState.dirObject);
			return true; // This is a valid (successful) return condition
		}
	}
	if (debugFlag_filesystem) debugStringInt32_P(PSTR("File system: filesystemGetFatFileInfo(): Requested directory entry found for entry number "), fileNumber, true);
		
	// Is the entry a file or sub-directory?
	if(filesystemState.fsInfo.fattrib & AM_DIR)
	{
		// Directory
		buffer[0] = 2;  // directory entry is a directory
		if(debugFlag_filesystem) debugString_P(PSTR("File system: filesystemGetFatFileInfo(): Directory entry is a directory called "));
		if (debugFlag_filesystem) debugString(filesystemState.fsInfo.fname);
		if (debugFlag_filesystem) debugString_P(PSTR("\r\n"));
			
		// Directories always have a file size of 0
		buffer[1] = 0;
		buffer[2] = 0;
		buffer[3] = 0;
		buffer[4] = 0;
			
		// Store the file name of the directory entry in the buffer (limited to 126 characters and NULL (0x00) terminated)
		if(strlen(filesystemState.fsInfo.fname) > 125) filesystemState.fsInfo.fname[126] = '\0';
			
		// Copy the string into the buffer - starting from byte 127
		strcpy((char*)buffer + 127, filesystemState.fsInfo.fname);
	}
	else
	{
		// File
		buffer[0] = 1;  // directory entry is a file
		if(debugFlag_filesystem) debugString_P(PSTR("File system: filesystemGetFatFileInfo(): Directory entry is a file called "));
		if (debugFlag_filesystem) debugString(filesystemState.fsInfo.fname);
		if (debugFlag_filesystem) debugString_P(PSTR("\r\n"));
			
		// Get the directory entry's file size in bytes (64-bit as we have exFAT configured)
		uint64_t fileSize = (uint64_t)filesystemState.fsInfo.fsize;
			
		// The maximum supported file size in ADFS is 512Mbytes (524,288 Kbytes or 536,870,912)
		// If the file size is bigger than this, the file must be truncated.
		if(fileSize > 536870912)
		{
			if (debugFlag_filesystem) debugString_P(PSTR("File system: filesystemGetFatFileInfo(): Directory entry is > 536870912 bytes... it will be truncated.\r\n"));
			fileSize = 536870912;  // Perhaps this limit should be ~500Mbytes, as file-system overhead will prevent 512Mb files being stored? Should be stress-tested...
		}
		else
		{
			if (debugFlag_filesystem) debugStringInt32_P(PSTR("File system: filesystemGetFatFileInfo(): Directory entry file size (in bytes) is "), (uint32_t)fileSize, true);
		}
			
		// Convert the file size into a 32 bit number and place it in 4 bytes of the buffer (1-4)
		buffer[1] = (fileSize & 0xFF000000UL) >> 24;
		buffer[2] = (fileSize & 0x00FF0000UL) >> 16;
		buffer[3] = (fileSize & 0x0000FF00UL) >>  8;
		buffer[4] = (fileSize & 0x000000FFUL);
			
		// Store the file name of the directory entry in the buffer (limited to 126 characters and NULL (0x00) terminated)
			
		// Truncate the string to 127 bytes
		if(strlen(filesystemState.fsInfo.fname) > 125) filesystemState.fsInfo.fname[126] = '\0';
			
		// Copy the string into the buffer - starting from byte 127
		strcpy((char*)buffer + 127, filesystemState.fsInfo.fname);
	}

	// Close the directory object
	f_closedir(&filesystemState.dirObject);
		
